app/views/plants/_form.html.erb

	<%= f.label :"Grow Bed" %><br>
	<%= f.collection_select :bed_id, Bed.all, :id, :name, {:include_blank => "Please select"} %><br>
---
SELECT "beds".* FROM "beds"