app/views/plants/edit.html.erb

SELECT "beds".* FROM "beds"
---
	<%= f.label :"Grow Bed" %><br>
	<%= f.collection_select :bed_id, Bed.all, :id, :name, {:include_blank => "Please select"} %><br>