app/views/plants/index.html.erb

                <td><%= link_to plant.bed.name, bed_path(plant.bed) %></td>
                <% if plant.harvests.count > 0 %>
---
SELECT "harvests".* FROM "harvests" WHERE "harvests"."plant_id" = ? ORDER BY "harvests"."id" DESC LIMIT ?  [["plant_id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "harvests" WHERE "harvests"."plant_id" = ?  [["plant_id", 1]]