app/views/plants/show.html.erb

SELECT "harvests".* FROM "harvests" WHERE "harvests"."plant_id" = ?  [["plant_id", 32]]
---
<p> <strong> Harvests: </strong>
<P><% @plant.harvests.each do |harvest| %>