app/controllers/beds_controller.rb

  def create
    @bed = Bed.create(bed_params)
---
INSERT INTO "beds" ("name", "location", "size", "medium", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Grow Rack 3"], ["location", "Basement"], ["size", 2], ["medium", "Soil"], ["created_at", "2020-06-17 15:16:32.177238"], ["updated_at", "2020-06-17 15:16:32.177238"]]

  def update
    if @bed
      if@bed.update(bed_params)
---
UPDATE "beds" SET "location" = ?, "size" = ?, "medium" = ?, "updated_at" = ? WHERE "beds"."id" = ?  [["location", ""], ["size", 2], ["medium", "Soil"], ["updated_at", "2020-06-22 13:07:49.950510"], ["id", 31]]

  def bed_finder
    @bed = current_user.beds.find_by(id: params[:id])
---
SELECT "beds".* FROM "beds" INNER JOIN "plants" ON "beds"."id" = "plants"."bed_id" WHERE "plants"."user_id" = ? AND "beds"."id" = ? LIMIT ?  [["user_id", 3], ["id", 25], ["LIMIT", 1]]