app/controllers/beds_controller.rb

SELECT "beds".* FROM "beds" WHERE "beds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @bed = Bed.find_by(id: params[:id])