app/controllers/harvests_controller.rb

  def create
    @harvest = Harvest.create(harvest_params)
---
INSERT INTO "harvests" ("weight", "harvest_date", "plant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["weight", 1.0], ["harvest_date", "2020-06-16"], ["plant_id", 8], ["created_at", "2020-06-17 21:59:03.062408"], ["updated_at", "2020-06-17 21:59:03.062408"]]