app/controllers/harvests_controller.rb

  def show
    if user_signed_in?
      if params[:plant_id]
        @plant = current_user.plants.find_by(id: params[:plant_id])
        if @plant
          @harvest = current_user.harvests.find_by(id: params[:id])
          if @harvest
            render :show
          else
            redirect_to @plant
          end
        else
          redirect_to plants_path
        end
      else
        @harvest = current_user.harvests.find_by(id: params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ? AND "plants"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "harvests".* FROM "harvests" INNER JOIN "plants" ON "harvests"."plant_id" = "plants"."id" WHERE "plants"."user_id" = ? AND "harvests"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "harvests".* FROM "harvests" INNER JOIN "plants" ON "harvests"."plant_id" = "plants"."id" WHERE "plants"."user_id" = ? AND "harvests"."id" = ? LIMIT ?  [["user_id", 3], ["id", 10], ["LIMIT", 1]]

  def new
    if user_signed_in?
      if params[:plant_id]
        @plant = current_user.plants.find_by(id: params[:plant_id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ? AND "plants"."id" = ? LIMIT ?  [["user_id", 1], ["id", 37], ["LIMIT", 1]]

  def create
    if user_signed_in?
      if params[:harvest][:plant_id]
        @plant = current_user.plants.find_by(id: params[:harvest][:plant_id])
        if @plant
          @harvest = @plant.harvests.create(harvest_params)
---
SELECT "harvests".* FROM "harvests" WHERE "harvests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ? AND "plants"."id" = ? LIMIT ?  [["user_id", 1], ["id", 37], ["LIMIT", 1]]
INSERT INTO "harvests" ("weight", "harvest_date", "plant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["weight", 0.2], ["harvest_date", "2020-06-30"], ["plant_id", 37], ["created_at", "2020-07-01 14:25:21.167663"], ["updated_at", "2020-07-01 14:25:21.167663"]]

  def edit
    if user_signed_in?
      if params[:plant_id]
        @plant = current_user.plants.find_by(id: params[:plant_id])
        if @plant
          @harvest = current_user.harvests.find_by(id: params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ? AND "plants"."id" = ? LIMIT ?  [["user_id", 1], ["id", 37], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ? AND "plants"."id" = ? LIMIT ?  [["user_id", 3], ["id", 13], ["LIMIT", 1]]
SELECT "harvests".* FROM "harvests" INNER JOIN "plants" ON "harvests"."plant_id" = "plants"."id" WHERE "plants"."user_id" = ? AND "harvests"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]

  def update
    if user_signed_in?
      if params[:harvest][:plant_id]
        @plant = current_user.plants.find_by(id: params[:harvest][:plant_id])
        if @plant
          @harvest = current_user.harvests.find_by(id: params[:id])
          if @harvest
            @harvest.update(harvest_params)
---
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ? AND "plants"."id" = ? LIMIT ?  [["user_id", 1], ["id", 37], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
SELECT "harvests".* FROM "harvests" INNER JOIN "plants" ON "harvests"."plant_id" = "plants"."id" WHERE "plants"."user_id" = ? AND "harvests"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
UPDATE "harvests" SET "harvest_date" = ?, "updated_at" = ? WHERE "harvests"."id" = ?  [["harvest_date", "2020-06-29"], ["updated_at", "2020-07-01 14:33:45.671187"], ["id", 2]]

  def destroy
    if user_signed_in?
      if params[:id]
        @plant = current_user.plants.find_by(id: params[:id])
        if @plant
          @harvest = current_user.harvests.find_by(id: params[:format])
          if @harvest
            binding.pry
            @harvest.destroy
---
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ? AND "plants"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "harvests".* FROM "harvests" INNER JOIN "plants" ON "harvests"."plant_id" = "plants"."id" WHERE "plants"."user_id" = ? AND "harvests"."id" = ? LIMIT ?  [["user_id", 1], ["id", 5], ["LIMIT", 1]]
DELETE FROM "harvests" WHERE "harvests"."id" = ?  [["id", 5]]