app/controllers/plants_controller.rb

  def index
    @plants = current_user.plants.all
---
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ?  [["user_id", 3]]

  def show
    if params[:bed_id]
      @bed = current_user.beds.find_by(id: params[:bed_id])
    if @bed
      @plant = current_user.plants.find_by(id: params[:id])
      if @plant
        render :show
      else
        redirect_to plants_path
      end
    else
      redirect_to beds_path
    end
    else
      @plant = current_user.plants.find_by(id: params[:id])
---
SELECT "beds".* FROM "beds" INNER JOIN "plants" ON "beds"."id" = "plants"."bed_id" WHERE "plants"."user_id" = ? AND "beds"."id" = ? LIMIT ?  [["user_id", 3], ["id", 15], ["LIMIT", 1]]
SELECT "beds".* FROM "beds" INNER JOIN "plants" ON "beds"."id" = "plants"."bed_id" WHERE "plants"."user_id" = ? AND "beds"."id" = ? LIMIT ?  [["user_id", 2], ["id", 6], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ? AND "plants"."id" = ? LIMIT ?  [["user_id", 3], ["id", 21], ["LIMIT", 1]]
SELECT "beds".* FROM "beds" INNER JOIN "plants" ON "beds"."id" = "plants"."bed_id" WHERE "plants"."user_id" = ? AND "beds"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ? AND "plants"."id" = ? LIMIT ?  [["user_id", 3], ["id", 13], ["LIMIT", 1]]

  def new
    if params[:bed_id]
      @bed = current_user.beds.find_by(id: params[:bed_id])
---
SELECT "beds".* FROM "beds" INNER JOIN "plants" ON "beds"."id" = "plants"."bed_id" WHERE "plants"."user_id" = ? AND "beds"."id" = ? LIMIT ?  [["user_id", 3], ["id", 15], ["LIMIT", 1]]

  def create
    @plant = current_user.plants.create(plant_params)
---
INSERT INTO "plants" ("transplant_date", "nickname", "variety", "species", "description", "user_id", "bed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @plant.update(plant_params)
---
UPDATE "plants" SET "germination_date" = ?, "updated_at" = ? WHERE "plants"."id" = ?  [["germination_date", "2020-04-05"], ["updated_at", "2020-06-19 18:55:35.968792"], ["id", 1]]

  def plant_finder
    @plant = current_user.plants.find_by(id: params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ? AND "plants"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]