app/controllers/plants_controller.rb

SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @plant = Plant.find_by(id: params[:id])

SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "plants" SET "variety" = ?, "nickname" = ?, "species" = ?, "description" = ?, "germination_date" = ?, "updated_at" = ? WHERE "plants"."id" = ?  [["variety", "Detroit Red Beets"], ["nickname", ""], ["species", ""], ["description", ""], ["germination_date", "2020-05-04"], ["updated_at", "2020-06-17 17:10:44.934026"], ["id", 5]]
---
  def update
    @plant = Plant.find_by(id: params[:id])
    if @plant.update(plant_params)