app/controllers/plants_controller.rb

  def create
    if user_signed_in?
      @plant = current_user.plants.create(plant_params)
---
INSERT INTO "plants" ("transplant_date", "nickname", "variety", "species", "description", "user_id", "bed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    if user_signed_in?
      if params[:bed_id]
        @bed = current_user.beds.find_by(id: params[:bed_id])
        if @bed
          @plant = current_user.plants.find_by(id: params[:id])
          if @plant
            render :show
          else
            redirect_to plants_path
          end
        else
          redirect_to beds_path
        end
      else
        @plant = current_user.plants.find_by(id: params[:id])
---
SELECT "beds".* FROM "beds" WHERE "beds"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "beds".* FROM "beds" WHERE "beds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    if @plant.update(plant_params)
---
UPDATE "plants" SET "nickname" = ?, "species" = ?, "description" = ?, "transplant_date" = ?, "updated_at" = ? WHERE "plants"."id" = ?  [["nickname", "Tomato 1"], ["species", ""], ["description", ""], ["transplant_date", "2020-05-16"], ["updated_at", "2020-07-09 19:33:13.842476"], ["id", 26]]

  def plant_finder
    if user_signed_in?
      @plant = current_user.plants.find_by(id: params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ? AND "plants"."id" = ? LIMIT ?  [["user_id", 2], ["id", 6], ["LIMIT", 1]]