app/models/plant.rb

SELECT COUNT(*) FROM "harvests" WHERE "harvests"."plant_id" = ?  [["plant_id", 20]]
UPDATE "plants" SET "harvested" = ?, "updated_at" = ? WHERE "plants"."id" = ?  [["harvested", 1], ["updated_at", "2020-07-08 16:17:30.863519"], ["id", 21]]
---
  def harvest_status
    unless self.harvests.count == 0
    self.harvested = true
    self.save

SELECT COUNT(*) FROM "harvests" WHERE "harvests"."plant_id" = ?  [["plant_id", 1]]
SELECT "harvests".* FROM "harvests" WHERE "harvests"."plant_id" = ?  [["plant_id", 1]]
---
  def yield_amount
    amount = 0
    if self.harvests.count > 0