app/models/user.rb

INSERT INTO "users" ("username", "email", "encrypted_password", "created_at", "updated_at", "provider", "uid") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "github"], ["uid", "58449380"], ["LIMIT", 1]]
---
    def self.from_omniauth(auth)
      #binding.pry
      where(provider: auth.provider, uid: auth.uid).first_or_create do |user|