app/views/beds/edit.html.erb

SELECT DISTINCT "beds"."medium" FROM "beds"
---
    <%= f.label :"Grow Medium" %><br>
    <%= f.collection_select :medium, Bed.select(:medium).distinct, :medium, :medium, {:include_blank => "Please select"} %>