app/views/beds/show.html.erb

SELECT "plants".* FROM "plants" WHERE "plants"."bed_id" = ?  [["bed_id", 1]]
---
<h2>Plants in this Bed</h2>
<% @bed.plants.each do |plant| %>